add descriptions to collections
